"use client"
export const soglashenie = [
  {
    id: '1',
    title: 'Общие условия',
    description: '<p><br />1.1. Сайт создан в целях продвижения и купли-продажи Товаров, представленных на Сайте.<br />1.2. Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.<br />1.3. Для получения доступа к материалам Сайта Пользователю необходимо выполнить следующие действия:<br />- заполнить регистрационную форму;<br />1.4. Получая доступ к материалам Сайта, Пользователь считается присоединившимся к настоящему Соглашению.</p>',
  },
  {
    id: '2',
    title: 'Обязательства Пользователя',
    description: '<p><br />2.1. Пользователь соглашается не предпринимать действий и не оставлять комментарии и записи, которые могут рассматриваться как нарушающие российское законодательство или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных прав, общепринятые нормы морали и нравственности, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и сервисов Сайта. <br /> 2.2. Использование материалов Сайта без согласия правообладателей не допускается. <br /> 2.3. При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна. <br /> 2.4. Администрация Сайта не несет ответственности за посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на Сайте. <br /> 2.5. Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы. <br /> 2.6. Пользователь согласен с тем, что Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с рекламой, которая может быть размещена на Сайте.</p>',
  },
  {
    id: '3',
    title: 'Прочие условия',
    description: '<p><br />3.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации. <br />3.2. Признание судом какого-либо положения Соглашения недействительным или не подлежащим принудительному исполнению не влечет недействительности иных положений Соглашения. <br />3.3. Бездействие со стороны Администрации Сайта в случае нарушения кем-либо из Пользователей положений Соглашения не лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту своих интересов и защиту авторских прав на охраняемые в соответствии с законодательством материалы Сайта. <br />3.4. Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего Соглашения. Такие изменения вступают в силу по истечении 3 (Три) дней с момента размещения новой версии Соглашения на сайте. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, прекратить использование материалов и сервисов Сайта. <br />3.5. Переходя по ссылке, Пользователь подтверждает, что принимает условия настоящего Соглашения, а также Политики конфиденциальности Сайта, являющейся неотъемлемой частью настоящего Соглашения и размещенной на странице по адресу: https://morskoi-koktail.ru/Soglashenie.</p>',
  }
];
